<!-- 联防联控业务流程-步骤五 -->
<template>
  <div>
    <div class="title">联防联控预案生成</div>
    <div class="layout-main">
      <el-row class="layout-row" :gutter="32" type="flex" justify="center">
        <!-- 联防联控预案编辑面板 -->
        <el-col :span="15">
          <el-card>
            <div slot="header" style="font-weight: bold;">
              <i class="el-icon-edit"></i>
              联防联控预案编辑
            </div>
            <div id="exportContent" class="layout-edit">
              <div style="text-align: center">
                <h1>传染病灾害预案</h1>
              </div>
              <el-collapse v-model="activeNames">
                <el-collapse-item v-for="(item, index) in planTexts" :key="index" :title="item.label"
                                  :name="item.value"
                                  v-if="ChosedItem.indexOf(item.value) !== -1">
                  <pre class="update">{{ item.text }}</pre>
                </el-collapse-item>
              </el-collapse>
              <!--              <div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('1'))">1 总则</h1>-->
              <!--                  <div v-if="ChosedItem.indexOf('1-1') !== -1">-->
              <!--                    <h2>1.1 编制目的</h2>-->
              <!--                    <p class="update">-->
              <!--                      为有效预防、及时控制和消除突发公共卫生事件及其可能造成的危害，指导和规范本市突发公共卫生事件应急处置，提高事件应急处置能力，最大程度地减少损失和影响，保障公众身心健康与生命安全，编制本预案。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('1-2') !== -1">-->
              <!--                    <h2>1.2 编制依据</h2>-->
              <!--                    <p class="update">-->
              <!--                      依据《中华人民共和国传染病防治法》、《突发公共卫生事件应急条例》和《国家突发公共卫生事件应急预案》、《上海市突发公共事件总体应急预案》等法律法规及有关规定，制订本预案。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('1-3') !== -1">-->
              <!--                    <h2>1.3 事件分级</h2>-->
              <!--                    <pre class="update">Ⅰ. 本预案所称的突发公共卫生事件，指突然发生、造成或者可能造成社会公众身心健康严重损害的传染病疫情、群体性不明原因疾病、以及其他严重影响公众健康和生命安全的事件。-->

              <!--Ⅱ. 根据《国家突发公共卫生事件应急预案》，本市突发公共卫生事件分为四级：Ⅰ级（特别重大）、Ⅱ级（重大）、Ⅲ级（较大）和Ⅳ级（一般）。其中，特别重大突发公共卫生事件主要包括：-->
              <!--①发现肺鼠疫病例，并有扩散趋势；-->
              <!--②发现肺炭疽病例，并有扩散趋势；-->
              <!--③发现传染性非典型肺炎、人感染高致病性禽流感病例，并有扩散趋势；-->
              <!--④群体性不明原因疾病涉及包括本市在内的多个省份，并有扩散趋势；-->
              <!--⑤新传染病或我国尚未发现的传染病在本市发生或传入本市，并有扩散趋势，或发现我国已消灭的传染病在本市重新流行；-->
              <!--⑥发生高致病性病菌株、毒株、致病因子等丢失事件；-->
              <!--⑦周边以及与我国通航的国家和地区发生特大传染病疫情，本市出现输入性病例，严重危及公共卫生安全；-->
              <!--⑧卫生部认定的其他特别重大突发公共卫生事件。-->

              <!--依据《上海市突发公共事件总体应急预案》，一次死亡3人以上列为报告和应急处置的重大事项。对涉外、敏感、可能恶化的事件，应加强情况报告并提高响应等级。</pre>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('1-4') !== -1">-->
              <!--                    <h2>1.4 适用范围</h2>-->
              <!--                    <pre class="update">本预案适用于本市突发公共卫生事件的应急处置。-->
              <!--发生食物中毒、职业中毒、以及病原微生物实验室生物安全管理，按照其他有关规定执行。-->
              <!--其他突发公共事件涉及的医疗卫生应急救援，依据《上海市突发公共事件医疗卫生救援应急预案》执行。</pre>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('1-5') !== -1">-->
              <!--                    <h2>1.5 工作原则</h2>-->
              <!--                    <p class="update">-->
              <!--                      统一领导、分级负责，以人为本、依法规范，快速反应、协同应对，资源整合、依靠科技，预防为主、防救结合。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('2'))">2 组织体系</h1>-->
              <!--                  <div v-if="ChosedItem.indexOf('2-1') !== -1">-->
              <!--                    <h2>2.1 领导机构</h2>-->
              <!--                    <p class="update">《上海市突发公共事件总体应急预案》明确，本市突发公共事件应急管理工作由市委、市政府统一领导。市政府是突发公共事件应急管理工作的行政领导机构。市应急委决定和部署突发公共事件应急管理工作，其日常事务由市应急办负责。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('2-2') !== -1">-->
              <!--                    <h2>2.2 应急联动机构</h2>-->
              <!--                    <p class="update">-->
              <!--                      市应急联动中心设在市公安局，作为本市突发公共事件应急联动先期处置的职能机构和指挥平台，履行应急联动处置较大和一般突发公共事件、组织联动单位对特大或重大突发公共事件进行先期处置等职责。各联动单位在各自职责范围内，负责突发公共事件应急联动先期处置。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('2-3') !== -1">-->
              <!--                    <h2>2.3 工作机构</h2>-->
              <!--                    <p class="update">-->
              <!--                      一旦发生特别重大和重大突发公共卫生事件，市政府根据应急处置需要，设立市突发公共卫生事件应急处置指挥部，实施对特别重大和重大突发公共卫生事件应急处置的统一指挥。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('2-4') !== -1">-->
              <!--                    <h2>2.4 专家机构</h2>-->
              <!--                    <p class="update">-->
              <!--                      市卫生局负责组建突发公共卫生事件专家组，并与本市其他相关专家机构建立联络机制，在突发公共卫生事件发生后，从突发公共卫生事件专家组中确定相关专家，为应急处置工作提供决策建议和技术指导，必要时参与突发公共卫生事件的应急处置。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('2-5') !== -1">-->
              <!--                    <h2>2.5 专业技术机构</h2>-->
              <!--                    <p class="update">-->
              <!--                      本市各级各类医疗卫生机构是突发公共卫生事件应急处置的专业技术机构，要结合本单位职责，开展专业技术人员处置突发公共卫生事件能力培训，提高快速应对能力和专业技术水平。发生突发公共卫生事件后，相关医疗卫生机构要按照市应急处置指挥部或市卫生局的统一指挥实施应急处置。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('3'))">3 预警预防与报告机制</h1>-->
              <!--                  <div v-if="ChosedItem.indexOf('3-1') !== -1">-->
              <!--                    <h2>3.1 信息监测</h2>-->
              <!--                    <pre class="update">Ⅰ.本市建立突发公共卫生事件监测、预警与报告网络体系。各级医疗机构、疾病预防控制机构、卫生监督机构和出入境检疫机构要根据各自职责，开展突发公共卫生事件的日常监测。-->

              <!--Ⅱ.各级卫生部门要加强对监测工作的管理和监督，保证监测质量。</pre>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('3-2') !== -1">-->
              <!--                    <h2>3.2 预警级别与发布</h2>-->
              <!--                    <p class="update">-->
              <!--                      根据突发公共卫生事件的发生性质、可能造成的危害和影响范围，本市突发公共卫生事件预警级别分为四级：Ⅰ级（特别严重）、Ⅱ级（严重）、Ⅲ级（较重）和Ⅳ级（一般），依次用红色、橙色、黄色和蓝色表示。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('3-3') !== -1">-->
              <!--                    <h2>3.3 信息报告</h2>-->
              <!--                    <pre class="update">任何单位和个人都有义务向各级政府和卫生部门等报告突发公共卫生事件及其隐患，也有权向有关上级政府部门举报不履行或者不按照规定履行突发公共卫生事件应急处置职责的部门、单位及个人。-->

              <!--本市各级人民政府卫生行政部门指定的突发公共卫生事件监测机构、各级各类医疗卫生机构、卫生行政部门、各级人民政府和检验检疫机构、食品药品监督管理机构、环境保护监测机构、教育机构等有关单位为突发公共卫生事件的责任报告单位。执行职务的各级各类医疗卫生机构的医疗卫生人员、个体开业医生为突发公共卫生事件的责任报告人。-->

              <!--突发公共卫生事件责任报告单位要按照有关规定及时、准确地报告突发公共卫生事件及其处置情况。</pre>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('4'))">4 应急响应</h1>-->
              <!--                  <div v-if="ChosedItem.indexOf('4-1') !== -1">-->
              <!--                    <h2>4.1 应急响应原则</h2>-->
              <!--                    <pre class="update">发生突发公共卫生事件后，市、区县政府及有关部门按照分级响应原则，采取相应措施实施应急处置。同时，遵循突发公共卫生事件发生发展规律，结合实际情况和预防控制工作需要，及时调整预警和反应级别，控制事态，减少危害和影响。根据不同类别突发公共卫生事件的性质、特点和事件发展趋势，对事态和影响不断扩大的事件，要及时升级预警和反应级别；对范围局限、不会进一步扩散的事件，要相应降低反应级别，及时撤销预警。-->

              <!--对在学校、区域性或全国性重要活动期间等发生的突发公共卫生事件，可相应提高报告和反应级别，确保迅速、有效地控制事态发展。-->

              <!--突发公共卫生事件应急处置要采取边调查、边处置、边抢救、边核实的方式，采取有效措施控制事态发展。-->

              <!--其他区县卫生部门接到突发公共卫生事件情况通报后，要及时通知相应的医疗卫生机构，组织做好应急处置所需的人员与物资准备，采取必要的预防控制措施，防止突发公共卫生事件在本行政区域发生，并按照市卫生局的统一指挥和调度，支援突发公共卫生事件发生地的应急处置工作。</pre>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('4-2') !== -1">-->
              <!--                    <h2>4.2 分级响应</h2>-->
              <!--                    <pre class="update">特别重大突发公共卫生事件应急处理工作由国务院或国务院卫生行政部门和有关部门组织实施。-->

              <!--重大突发公共卫生事件应急处理工作由上海市政府或上海市政府卫生行政部门和有关部门组织实施，开展突发公共卫生事件的医疗卫生应急、信息发布、宣传教育、应急物资与设备的调集、后勤保障以及督导检查等工作。事发地的区县人民政府按照市政府或市政府有关部门的统一部署，结合本地区实际情况，组织协调开展突发公共事件的应急处理工作。-->

              <!--重大级别以下的突发公共卫生事件应急处理工作由区县人民政府负责组织实施。超出本级应急处置能力时，区县人民政府要报请市政府和有关部门提供指导和支持。</pre>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('4-3') !== -1">-->
              <!--                    <h2>4.3 响应措施</h2>-->
              <!--                    <pre class="update">Ⅰ.各级政府-->
              <!--（1）组织协调有关部门参与突发公共卫生事件的处置。-->
              <!--（2）根据突发公共卫生事件处置需要，调集本行政区域内相关人员、物资、交通工具和相关设备、设施参与应急处置。-->
              <!--（3）划定控制区域。甲类、乙类传染病暴发、流行时，各级政府报经上一级政府决定后，可以宣布疫区范围；经国务院同意，市政府可以对本市内甲类传染病疫区实施封锁。-->
              <!--（4）控制疫情。依照有关法律、法规、规章的规定，在本行政区域内限制或停止集市、集会、影剧院演出、以及其他人群聚集的活动；视情组织停工、停业、停课；封闭或者封存被传染病病原体污染的公共饮用水源、食品以及相关物品；临时征用房屋、交通工具以及相关设备和设施。-->
              <!--（5）加强流动人口管理。开展流动人口流行病预防工作，落实控制措施，对传染病病人、疑似病人采取就地隔离、就地观察、就地治疗的措施，对密切接触者要视情采取集中或居家医学观察。-->
              <!--（6）开展交通卫生检疫。组织铁路、交通、民航、港口等部门在交通站点设置临时交通卫生检疫站，对进出疫区和运行中的交通工具及其乘运人员和物资、宿主动物等进行检疫查验，对病人、疑似病人及其密切接触者实施临时隔离、留验，并移交地方卫生行政部门指定的机构。-->
              <!--（7）发布信息。督促有关部门按照规定做好信息发布。-->
              <!--（8）组织群防群控。督促街道、乡镇以及居委会、村委会协助卫生部门和其他部门、医疗机构搞好疫情信息的收集、报告，人员的分散隔离及公共卫生措施的实施。-->
              <!--（9）维护社会稳定。组织有关部门保障商品供应，平抑物价，防止哄抢；严厉打击造谣传谣、哄抬物价、囤积居奇、制假售假等违法犯罪和扰乱社会治安的行为。-->

              <!--Ⅱ.卫生部门-->
              <!--（1）组织医疗机构、疾病预防控制机构和卫生监督机构进行突发公共卫生事件的调查与处置。-->
              <!--（2）组织突发公共卫生事件专家组，对突发共卫生事件进行评估，提出建议启动突发公共卫生事件应急处置的级别。-->
              <!--（3）采取应急控制措施。根据需要组织开展应急疫苗接种、预防服药等。-->
              <!--（4）进行督导检查。市卫生局组织对全市或重点区域的应急处置进行督导和检查；区县卫生部门负责对本行政区域内的应急处置工作进行督查和指导。-->
              <!--（5）发布与通报信息。经市政府或国务院卫生部门授权，市卫生局要及时向社会发布突发公共卫生事件的信息或公告，并向各有关部门和各区县卫生行政部门通报突发公共卫生事件情况。-->
              <!--（6）开展技术标准和规范培训。根据国务院卫生行政部门制定的技术标准和规范，市和区县卫生部门分级组织对新发现的突发传染病、不明原因群体性疾病等及时开展培训工作。-->
              <!--（7）普及卫生知识。根据事件性质，有针对性地开展卫生知识宣教，提高公众健康意识和自我防护能力，做好心理危机干预工作。-->
              <!--（8）进行事件评估。组织专家对突发公共卫生事件的处置情况进行综合评估，包括事件概况、现场调查处置情况、病人救治情况、已采取的措施、效果评价等。-->

              <!--Ⅲ.医疗机构-->
              <!--（1）开展病人接诊、收治和转运工作，实行重症和普通病人分开管理，对疑似病人及时排除或确诊。-->
              <!--（2）对群体性不明原因疾病和新发传染病做好病例分析与总结，积累诊断治疗经验。重大中毒事件，按照现场救援、病人转运、后续治疗相结合的原则进行处置。-->
              <!--（3）搞好医院内现场控制、消毒隔离、个人防护、医疗垃圾和污水处理等，防止院内交叉感染和污染。-->
              <!--（4）负责传染病和中毒病人的报告。对突发公共卫生事件造成身体伤害的病人，任何医疗机构不得拒绝接诊。-->
              <!--（5）协助疾病预防控制机构人员开展标本采集、流行病学调查等工作。-->

              <!--Ⅳ.疾病预防控制机构-->
              <!--（1）报告信息。各级疾病预防控制机构要搞好突发公共卫生事件的信息收集、分析与报告。-->
              <!--（2）进行流行病学调查。疾控机构人员到达现场后，尽快制定流行病学调查计划和方案，按照计划和方案对突发事件累及人群的发病情况、分布特点进行调查分析，提出并实施有针对性的预防控制措施；对传染病病人、疑似病人、病原携带者及其密切接触者进行追踪调查，查明传播链，并向相关疾病预防控制机构通报情况。-->
              <!--（3）开展实验室检测。市和区县疾病预防控制机构根据国家疾病预防控制中心的要求，开展危险因素检测，按照有关技术规范采集和分送标本、承担现场和实验室检测任务，查找致病原因。-->
              <!--（4）开展科研与国际交流。开展与突发事件相关的诊断试剂、疫苗、消毒方法、医疗卫生防护用品等方面的研究和国际交流。-->
              <!--（5）制定技术方案。市疾病预防控制中心协助市卫生局根据国家有关技术标准和规范，制定本市的技术方案或实施方案。-->
              <!--（6）开展技术培训。市、区县疾病预防控制中心分级负责本市各级医疗机构突发公共卫生事件应急处置专业技术人员的应急培训。-->

              <!--Ⅴ.卫生监督机构-->
              <!--（1）在卫生部门的领导下，开展对医疗机构、疾病预防控制机构突发公共卫生事件应急处置各项措施落实情况的督导、检查。-->
              <!--（2）围绕突发公共卫生事件应急处置工作，开展卫生监督，对发现存在问题的情况提出行政处罚的意见。-->
              <!--（3）依据《突发公共卫生事件应急条例》和有关法规、规章，调查处理突发公共卫生事件应急处置中的违法行为。-->

              <!--Ⅵ.出入境检验检疫机构-->
              <!--（1）突发公共卫生事件发生后，调动出入境检验检疫机构技术力量，对出入境、进出疫区和运行中的交通工具及其乘运人员、物资、宿主动物等进行检疫查验；对病人、疑似病人及其密切接触者实施临时隔离、留验，并移交指定机构。-->
              <!--（2）及时上报和通报口岸突发公共卫生事件信息和事态发展。-->

              <!--Ⅶ.非事发地区-->
              <!--未发生突发公共卫生事件的区县要根据其他地区发生事件的性质、特点、发生区域和发展趋势，分析本地区受波及的可能性和危害程度，重点做好以下工作：-->
              <!--（1）密切保持与事件发生地区的联系，及时获取相关信息。-->
              <!--（2）组织做好本行政区域应急处置所需的人员与物资准备。-->
              <!--（3）加强相关疾病与健康监测和报告工作，必要时，建立专门报告制度。-->
              <!--（4）开展重点人群、重点场所和重点环节的监测和预防控制。-->
              <!--（5）开展防治知识宣传和健康教育，提高公众自我保护意识和能力。-->
              <!--（6）根据市政府及其有关部门决定，开展交通卫生检疫等。</pre>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('4-4') !== -1">-->
              <!--                    <h2>4.4 应急响应终止</h2>-->
              <!--                    <pre class="update">突发公共卫生事件应急响应的终止需符合以下条件：突发公共卫生事件隐患或相关危险因素消除，或末例传染病病例发生后经过最长潜伏期无新的病例出现。-->
              <!--特别重大突发公共卫生事件由卫生部组织有关专家进行分析论证，提出终止应急响应的建议，报国务院或国家相关应急指挥机构批准后实施。-->
              <!--重大突发公共卫生事件由市卫生局组织专家进行分析论证，提出终止应急响应的建议，报市政府或市应急处置指挥部批准后实施，并向卫生部报告。-->
              <!--较大突发公共卫生事件由市卫生局组织专家进行分析论证，提出终止应急响应的建议，报市政府批准后实施。-->
              <!--一般突发公共卫生事件由区县卫生部门组织专家进行分析论证，提出终止应急响应的建议，报区县政府或区县突发公共卫生事件应急指挥机构批准后实施，并向市卫生局报告。</pre>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('5'))">5 后期处置</h1>-->
              <!--                  <div v-if="ChosedItem.indexOf('5-1') !== -1">-->
              <!--                    <h2>5.1 后期评估</h2>-->
              <!--                    <p class="update">-->
              <!--                      突发公共卫生事件结束后，各级卫生部门要在本级政府的领导下，组织有关人员对突发公共卫生事件的处置情况进行评估。评估内容主要包括事件概况、调查处置情况、病人救治情况、所采取措施的效果评价、应急处置过程中存在的问题、取得的经验及改进建议。评估报告上报本级政府和上一级卫生部门。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('5-2') !== -1">-->
              <!--                    <h2>5.2 抚恤和补助</h2>-->
              <!--                    <p class="update">-->
              <!--                      有关部门对因参与应急处置工作致病、致残、死亡的人员，按照国家有关规定，给予相应的补助和抚恤；对参加应急处置一线工作的专业技术人员，要根据工作需要制定合理的补助标准，给予补助。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('5-3') !== -1">-->
              <!--                    <h2>5.3 征用物资、劳务补偿</h2>-->
              <!--                    <p class="update">-->
              <!--                      突发公共卫生事件应急工作结束后，各级政府要组织有关部门对应急处置期间紧急调集、征用有关单位、企业、个人的物资和劳务进行评估，给予合理补偿。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('6'))">6 应急保障</h1>-->
              <!--                  <p v-if="ChosedItem.some(item => item.startsWith('6'))" class="update">-->
              <!--                    突发公共卫生事件应急处置要坚持预防为主、平战结合。本市各级政府和卫生部门要加强应对突发公共卫生事件的组织建设，组织开展突发公共卫生事件的监测和预警工作，加强突发公共卫生事件应急处置队伍建设和技术研究，建立健全统一的突发公共卫生事件预防控制体系，保证突发公共卫生事件应急处置的顺利实施。-->
              <!--                  </p>-->
              <!--                  <div v-if="ChosedItem.indexOf('6-1') !== -1">-->
              <!--                    <h2>6.1 技术保障</h2>-->
              <!--                    <pre class="update">Ⅰ.信息系统-->
              <!--建立公共卫生事件应急信息系统，承担突发公共卫生事件及相关信息收集、处理、分析、发布和传递等工作，为日常监测、预警、报告和应急处置提供支撑；实现卫生部门、医疗救治机构与疾病预防控制机构、卫生监督机构之间的信息共享。-->

              <!--Ⅱ.疾病预防控制体系-->
              <!--建立统一的疾病预防控制体系。强化疾病预防控制机构和基层预防保健组织建设，强化医疗卫生机构疾病预防控制的责任；建立功能完善、反应迅速、运转协调的突发公共卫生事件应急机制；健全覆盖全市、灵敏高效、快速畅通的疫情信息网络；完善疾病预防控制机构基础设施和实验室设备条件；加强疾病控制专业队伍建设，提高流行病学调查、现场处置和实验室检测检验能力。-->

              <!--Ⅲ.应急医疗救治体系-->
              <!--建立由市和区县医疗救护机构、各类重点医疗机构及其他有关单位组成的应急医疗救治网络。逐步在本市建成覆盖城乡、功能完善、反应灵敏、运转协调、持续发展的医疗救治体系。-->

              <!--Ⅳ.卫生执法监督体系-->
              <!--各级卫生部门要明确职能，落实责任，规范执法监督行为。加强卫生执法监督队伍建设，对卫生监督人员实行资格准入制度和在岗培训制度，全面提高卫生执法监督的能力和水平。-->

              <!--Ⅴ.应急卫生救治队伍-->
              <!--各级政府卫生部门按照“平战结合、因地制宜，分类管理、分级负责，统一组织、协调运转”的原则建立突发公共卫生事件应急救治队伍。-->

              <!--Ⅵ.科研和国际交流-->
              <!--鼓励和支持相关部门和单位开展突发公共卫生事件有关技术的科学研究，以及相应的国内外交流与合作。-->
              <!--有计划地开展应对突发公共卫生事件相关的防治科学研究，包括现场流行病学调查方法、实验室病因检测技术、药物治疗、疫苗和应急反应装备、中医药及中西医结合防治等，尤其是开展新发、罕见传染病快速诊断方法、诊断试剂以及相关的疫苗研究，实现技术储备。同时，开展应对突发公共卫生事件应急处置技术的国际交流与合作，学习和适当引进国外先进技术、装备和方法，提高本市应对突发公共卫生事件的整体水平。</pre>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('6-2') !== -1">-->
              <!--                    <h2>6.2 物资保障</h2>-->
              <!--                    <p class="update">-->
              <!--                      根据“分级管理”原则和各自职责，负责组织协调相关应急物资的储备、调度和后续供应。市发展改革委、市经委等按照市应急处置指挥部的指令，负责组织协调应急处置中应急物资的调用和供应，各相关部门和单位负责具体实施。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('6-3') !== -1">-->
              <!--                    <h2>6.3 经费保障</h2>-->
              <!--                    <p class="update">-->
              <!--                      突发公共卫生事件常态管理所需的经费,由市卫生局报请市财政列入年度预算。应急处置所需的经费，由市财政按照有关预案和规定予以安排。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('6-4') !== -1">-->
              <!--                    <h2>6.4 通信保障</h2>-->
              <!--                    <p class="update">-->
              <!--                      各级应急医疗卫生救治队伍要根据实际工作需要配备通信设备。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('6-5') !== -1">-->
              <!--                    <h2>6.5 交通保障</h2>-->
              <!--                    <p class="update">-->
              <!--                      市交通局负责提供突发公共卫生事件应急处置的交通保障，有关区县政府协助配合。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('6-6') !== -1">-->
              <!--                    <h2>6.6 治安保障</h2>-->
              <!--                    <p class="update">-->
              <!--                      突发公共卫生事件发生后，实施现场治安警戒；事发地区县政府协助搞好治安保障。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('7'))">7 监督管理</h1>-->
              <!--                  <div v-if="ChosedItem.indexOf('7-1') !== -1">-->
              <!--                    <h1>7.1 公众宣传教育</h1>-->
              <!--                    <p class="update">-->
              <!--                      各级政府要组织有关部门利用广播、影视、报刊、互联网、手册等多种形式对社会公众广泛开展突发公共卫生事件应急知识普及教育，宣传卫生科普知识，指导群众以科学的行为和方式对待突发公共卫生事件。要充分发挥有关社会团体在普及卫生应急知识和卫生科普知识方面的作用。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('7-2') !== -1">-->
              <!--                    <h1>7.2 演练</h1>-->
              <!--                    <pre class="update">各级卫生部门和有关单位要按照“统一规划、分类实施、分级负责、突出重点、适应需求”的原则，采取定期和不定期相结合的形式，组织开展突发公共卫生事件的应急演练。-->

              <!--市卫生局要组织全市性的突发公共卫生事件应急演练，检验和加强应急处置能力，并对演练结果进行总结和评估，进一步完善应急预案。</pre>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--                <div>-->
              <!--                  <h1 v-if="ChosedItem.some(item => item.startsWith('8'))">8 附则</h1>-->
              <!--                  <div v-if="ChosedItem.indexOf('8-1') !== -1">-->
              <!--                    <h1>8.1 名词术语解释</h1>-->
              <!--                    （1）重大传染病疫情。指某种传染病在短时间内发生、波及范围广泛，出现大量的病人或死亡病例，其发病率远远超过常年的发病率水平的情况。-->
              <!--                    <br>-->
              <!--                    （2）群体性不明原因疾病。指在短时间内，某个相对集中的区域内同时或者相继出现具有共同临床表现病人，且病例不断增加，范围不断扩大，又暂时不能明确诊断的疾病。-->
              <!--                    <br>-->
              <!--                    （3）新传染病。指全球首次发现的传染病。-->
              <!--                    <br>-->
              <!--                    （4）我国尚未发现传染病。指埃博拉、猴痘、黄热病、人变异性克雅氏病等在其他国家和地区已经发现，在我国尚未发现过的传染病。-->
              <!--                    <br>-->
              <!--                    （5）我国已消灭传染病。指天花、脊髓灰质炎等传染病。-->
              <!--                  </div>-->
              <!--                  <div v-if="ChosedItem.indexOf('8-2') !== -1">-->
              <!--                    <h1>8.2 预案管理</h1>-->
              <!--                    <p>-->
              <!--                      本预案自印发之日起施行。-->
              <!--                    </p>-->
              <!--                  </div>-->
              <!--                </div>-->
              <!--              </div>-->
            </div>
          </el-card>
        </el-col>
        <!-- 联防联控预案信息支持面板 -->
        <el-col :span="9">
          <el-card>
            <div slot="header" style="font-weight: bold;">
              <i class="el-icon-document"></i>
              联防联控预案信息支持
            </div>
            <div>
              <el-radio v-model="choice_advice" :label="1" border>仿真模拟数据</el-radio>
              <el-radio v-model="choice_advice" :label="2" border>预案编制助手</el-radio>
            </div>
            <div class="layout-edit" v-show="choice_advice === 1" v-loading="updateRiskDisabled">
              <!-- <div class="simu-result">
                <h4>仿真模拟结果</h4>
                <hr>
                <div class="chart-container">
                  <div id="chartFlood" class="chart"></div>
                </div>
              </div> -->
              <div class="simu-result">
                <h4>防灾重点区域</h4>
                <hr>
                <div>
                  <!-- <span style="font-size:14px;">当前时间(天)：</span>
                  <el-input-number v-model="currentInfectionDay" style="width:100px;" :min="1" :precision="0" :step="1"
                    :max="maxInfectionDay" maxInfectionDaysize="small"></el-input-number>
                  <br>
                  <span style="font-size:14px;">当前时间(时)：</span>
                  <el-input-number v-model="currentInfectionHour" style="width:100px;" :min="0" :precision="0" :step="1"
                    :max="24" maxInfectionDaysize="small"></el-input-number>
                  <br>
                  <span style="font-size:14px;">感染人数阈值：</span>
                  <el-input-number v-model="thresholdInfected" style="width:100px;" :min="1" :precision="0" :step="1"
                    size="small"></el-input-number>
                  <el-button type="primary" size="small" @click="updateInfectionRisk" :disabled="updateRiskDisabled"
                    plain>更新</el-button> -->
                  <br>
                  <el-table :data="infectionDangerousPointList" max-height="300" border
                            style="width: 100%">
                    <el-table-column prop="display_name" label="地点">
                    </el-table-column>
                    <el-table-column prop="lon" label="经度" width="80">
                    </el-table-column>
                    <el-table-column prop="lat" label="纬度" width="80">
                    </el-table-column>
                    <el-table-column prop="population" label="感染人数" width="80">
                    </el-table-column>
                  </el-table>
                </div>
              </div>
              <div contentEditable="true" class="simu-result">
                <h4 contenteditable="false">预案编制建议</h4>
                <hr>
                <p>
                  需要注意的风险点包括：
                </p>
                <p v-for="(item, index) in adviceInfection.riskList">
                  {{ `${index + 1}.${item.name}。${item.text}` }}
                </p>
              </div>
            </div>
            <div v-show="choice_advice === 2">
              <iframe :src=LLM_URL class="layout-edit"></iframe>
            </div>
          </el-card>
        </el-col>
      </el-row>
    </div>
  </div>
</template>

<script>
import axios from "axios";
import serverInfo from '@/views/simulator/serverInfo';
import htmlDocx from 'html-docx-js/dist/html-docx';

export default {
  name: "stepE",
  props: {
    ChosedItem: {
      type: Array
    },
    items: {
      type: Array
    },
    city: {
      type: String
    },
    cityName: {
      type: String
    },
    taskId: "",
    task: {
      type: Object
    },
    riskSource: {
      type: Object
    },
  },
  components: {
  },
  data() {
    return {
      activeNames: [],
      planTexts:[
        {
          value: "1",
          label: "1 总则",
          text: "",
        },
        {
          value: "1-1",
          label: "1.1 编制目的",
          text: "为有效预防、及时控制和消除突发公共卫生事件及其可能造成的危害，指导和规范本市突发公共卫生事件应急处置，提高事件应急处置能力，最大程度地减少损失和影响，保障公众身心健康与生命安全，编制本预案。\n",
        },
        {
          value: "1-2",
          label: "1.2 编制依据",
          text: "依据《中华人民共和国传染病防治法》、《突发公共卫生事件应急条例》和《国家突发公共卫生事件应急预案》、《上海市突发公共事件总体应急预案》等法律法规及有关规定，制订本预案。\n"
        },
        {
          value: "1-3",
          label: "1.3 事件分级",
          text: "Ⅰ. 本预案所称的突发公共卫生事件，指突然发生、造成或者可能造成社会公众身心健康严重损害的传染病疫情、群体性不明原因疾病、以及其他严重影响公众健康和生命安全的事件。\n" +
            "\n" +
            "Ⅱ. 根据《国家突发公共卫生事件应急预案》，本市突发公共卫生事件分为四级：Ⅰ级（特别重大）、Ⅱ级（重大）、Ⅲ级（较大）和Ⅳ级（一般）。其中，特别重大突发公共卫生事件主要包括：\n" +
            "①发现肺鼠疫病例，并有扩散趋势；\n" +
            "②发现肺炭疽病例，并有扩散趋势；\n" +
            "③发现传染性非典型肺炎、人感染高致病性禽流感病例，并有扩散趋势；\n" +
            "④群体性不明原因疾病涉及包括本市在内的多个省份，并有扩散趋势；\n" +
            "⑤新传染病或我国尚未发现的传染病在本市发生或传入本市，并有扩散趋势，或发现我国已消灭的传染病在本市重新流行；\n" +
            "⑥发生高致病性病菌株、毒株、致病因子等丢失事件；\n" +
            "⑦周边以及与我国通航的国家和地区发生特大传染病疫情，本市出现输入性病例，严重危及公共卫生安全；\n" +
            "⑧卫生部认定的其他特别重大突发公共卫生事件。\n" +
            "\n" +
            "依据《上海市突发公共事件总体应急预案》，一次死亡3人以上列为报告和应急处置的重大事项。对涉外、敏感、可能恶化的事件，应加强情况报告并提高响应等级。"
        },
        {
          value: "1-4",
          label: "1.4 适用范围",
          text: "本预案适用于本市突发公共卫生事件的应急处置。\n" +
            "发生食物中毒、职业中毒、以及病原微生物实验室生物安全管理，按照其他有关规定执行。\n" +
            "其他突发公共事件涉及的医疗卫生应急救援，依据《上海市突发公共事件医疗卫生救援应急预案》执行。"
        },
        {
          value: "1-5",
          label: "1.5 工作原则",
          text: "统一领导、分级负责，以人为本、依法规范，快速反应、协同应对，资源整合、依靠科技，预防为主、防救结合。\n",
        },
        {
          value: "2",
          label: "2 组织体系",
          text: "",
        },
        {
          value: "2-1",
          label: "2.1 领导机构",
          text: "《上海市突发公共事件总体应急预案》明确，本市突发公共事件应急管理工作由市委、市政府统一领导。市政府是突发公共事件应急管理工作的行政领导机构。市应急委决定和部署突发公共事件应急管理工作，其日常事务由市应急办负责。\n"
        },
        {
          value: "2-2",
          label: "2.2 应急联动机构",
          text: "市应急联动中心设在市公安局，作为本市突发公共事件应急联动先期处置的职能机构和指挥平台，履行应急联动处置较大和一般突发公共事件、组织联动单位对特大或重大突发公共事件进行先期处置等职责。各联动单位在各自职责范围内，负责突发公共事件应急联动先期处置。\n"
        },
        {
          value: "2-3",
          label: "2.3 工作机构",
          text: "一旦发生特别重大和重大突发公共卫生事件，市政府根据应急处置需要，设立市突发公共卫生事件应急处置指挥部，实施对特别重大和重大突发公共卫生事件应急处置的统一指挥。\n",
        },
        {
          value: "2-4",
          label: "2.4 专家机构",
          text: "市卫生局负责组建突发公共卫生事件专家组，并与本市其他相关专家机构建立联络机制，在突发公共卫生事件发生后，从突发公共卫生事件专家组中确定相关专家，为应急处置工作提供决策建议和技术指导，必要时参与突发公共卫生事件的应急处置。\n",
        },
        {
          value: "2-5",
          label: "2.5 专业技术机构",
          text: "本市各级各类医疗卫生机构是突发公共卫生事件应急处置的专业技术机构，要结合本单位职责，开展专业技术人员处置突发公共卫生事件能力培训，提高快速应对能力和专业技术水平。发生突发公共卫生事件后，相关医疗卫生机构要按照市应急处置指挥部或市卫生局的统一指挥实施应急处置。\n",
        },
        {
          value: "3",
          label: "3 预警预防与报告机制",
          text: "",
        },
        {
          value: "3-1",
          label: "3.1 信息监测",
          text: "Ⅰ.本市建立突发公共卫生事件监测、预警与报告网络体系。各级医疗机构、疾病预防控制机构、卫生监督机构和出入境检疫机构要根据各自职责，开展突发公共卫生事件的日常监测。\n" +
            "\n" +
            "Ⅱ.各级卫生部门要加强对监测工作的管理和监督，保证监测质量。\n",
        },
        {
          value: "3-2",
          label: "3.2 预警级别与发布",
          text: "根据突发公共卫生事件的发生性质、可能造成的危害和影响范围，本市突发公共卫生事件预警级别分为四级：Ⅰ级（特别严重）、Ⅱ级（严重）、Ⅲ级（较重）和Ⅳ级（一般），依次用红色、橙色、黄色和蓝色表示。\n",
        },
        {
          value: "3-3",
          label: "3.3 信息报告",
          text: "任何单位和个人都有义务向各级政府和卫生部门等报告突发公共卫生事件及其隐患，也有权向有关上级政府部门举报不履行或者不按照规定履行突发公共卫生事件应急处置职责的部门、单位及个人。\n" +
            "\n" +
            "本市各级人民政府卫生行政部门指定的突发公共卫生事件监测机构、各级各类医疗卫生机构、卫生行政部门、各级人民政府和检验检疫机构、食品药品监督管理机构、环境保护监测机构、教育机构等有关单位为突发公共卫生事件的责任报告单位。执行职务的各级各类医疗卫生机构的医疗卫生人员、个体开业医生为突发公共卫生事件的责任报告人。\n" +
            "\n" +
            "突发公共卫生事件责任报告单位要按照有关规定及时、准确地报告突发公共卫生事件及其处置情况。\n",
        },
        {
          value: "4",
          label: "4 应急响应",
          text: "",
        },
        {
          value: "4-1",
          label: "4.1 应急响应原则",
          text: "发生突发公共卫生事件后，市、区县政府及有关部门按照分级响应原则，采取相应措施实施应急处置。同时，遵循突发公共卫生事件发生发展规律，结合实际情况和预防控制工作需要，及时调整预警和反应级别，控制事态，减少危害和影响。根据不同类别突发公共卫生事件的性质、特点和事件发展趋势，对事态和影响不断扩大的事件，要及时升级预警和反应级别；对范围局限、不会进一步扩散的事件，要相应降低反应级别，及时撤销预警。\n" +
            "\n" +
            "对在学校、区域性或全国性重要活动期间等发生的突发公共卫生事件，可相应提高报告和反应级别，确保迅速、有效地控制事态发展。\n" +
            "\n" +
            "突发公共卫生事件应急处置要采取边调查、边处置、边抢救、边核实的方式，采取有效措施控制事态发展。\n" +
            "\n" +
            "其他区县卫生部门接到突发公共卫生事件情况通报后，要及时通知相应的医疗卫生机构，组织做好应急处置所需的人员与物资准备，采取必要的预防控制措施，防止突发公共卫生事件在本行政区域发生，并按照市卫生局的统一指挥和调度，支援突发公共卫生事件发生地的应急处置工作。\n",
        },
        {
          value: "4-2",
          label: "4.2 分级响应",
          text: "特别重大突发公共卫生事件应急处理工作由国务院或国务院卫生行政部门和有关部门组织实施。\n" +
            "\n" +
            "重大突发公共卫生事件应急处理工作由上海市政府或上海市政府卫生行政部门和有关部门组织实施，开展突发公共卫生事件的医疗卫生应急、信息发布、宣传教育、应急物资与设备的调集、后勤保障以及督导检查等工作。事发地的区县人民政府按照市政府或市政府有关部门的统一部署，结合本地区实际情况，组织协调开展突发公共事件的应急处理工作。\n" +
            "\n" +
            "重大级别以下的突发公共卫生事件应急处理工作由区县人民政府负责组织实施。超出本级应急处置能力时，区县人民政府要报请市政府和有关部门提供指导和支持。\n",
        },
        {
          value: "4-3",
          label: "4.3 响应措施",
          text: "Ⅰ.各级政府\n" +
            "（1）组织协调有关部门参与突发公共卫生事件的处置。\n" +
            "（2）根据突发公共卫生事件处置需要，调集本行政区域内相关人员、物资、交通工具和相关设备、设施参与应急处置。\n" +
            "（3）划定控制区域。甲类、乙类传染病暴发、流行时，各级政府报经上一级政府决定后，可以宣布疫区范围；经国务院同意，市政府可以对本市内甲类传染病疫区实施封锁。\n" +
            "（4）控制疫情。依照有关法律、法规、规章的规定，在本行政区域内限制或停止集市、集会、影剧院演出、以及其他人群聚集的活动；视情组织停工、停业、停课；封闭或者封存被传染病病原体污染的公共饮用水源、食品以及相关物品；临时征用房屋、交通工具以及相关设备和设施。\n" +
            "（5）加强流动人口管理。开展流动人口流行病预防工作，落实控制措施，对传染病病人、疑似病人采取就地隔离、就地观察、就地治疗的措施，对密切接触者要视情采取集中或居家医学观察。\n" +
            "（6）开展交通卫生检疫。组织铁路、交通、民航、港口等部门在交通站点设置临时交通卫生检疫站，对进出疫区和运行中的交通工具及其乘运人员和物资、宿主动物等进行检疫查验，对病人、疑似病人及其密切接触者实施临时隔离、留验，并移交地方卫生行政部门指定的机构。\n" +
            "（7）发布信息。督促有关部门按照规定做好信息发布。\n" +
            "（8）组织群防群控。督促街道、乡镇以及居委会、村委会协助卫生部门和其他部门、医疗机构搞好疫情信息的收集、报告，人员的分散隔离及公共卫生措施的实施。\n" +
            "（9）维护社会稳定。组织有关部门保障商品供应，平抑物价，防止哄抢；严厉打击造谣传谣、哄抬物价、囤积居奇、制假售假等违法犯罪和扰乱社会治安的行为。\n" +
            "\n" +
            "Ⅱ.卫生部门\n" +
            "（1）组织医疗机构、疾病预防控制机构和卫生监督机构进行突发公共卫生事件的调查与处置。\n" +
            "（2）组织突发公共卫生事件专家组，对突发共卫生事件进行评估，提出建议启动突发公共卫生事件应急处置的级别。\n" +
            "（3）采取应急控制措施。根据需要组织开展应急疫苗接种、预防服药等。\n" +
            "（4）进行督导检查。市卫生局组织对全市或重点区域的应急处置进行督导和检查；区县卫生部门负责对本行政区域内的应急处置工作进行督查和指导。\n" +
            "（5）发布与通报信息。经市政府或国务院卫生部门授权，市卫生局要及时向社会发布突发公共卫生事件的信息或公告，并向各有关部门和各区县卫生行政部门通报突发公共卫生事件情况。\n" +
            "（6）开展技术标准和规范培训。根据国务院卫生行政部门制定的技术标准和规范，市和区县卫生部门分级组织对新发现的突发传染病、不明原因群体性疾病等及时开展培训工作。\n" +
            "（7）普及卫生知识。根据事件性质，有针对性地开展卫生知识宣教，提高公众健康意识和自我防护能力，做好心理危机干预工作。\n" +
            "（8）进行事件评估。组织专家对突发公共卫生事件的处置情况进行综合评估，包括事件概况、现场调查处置情况、病人救治情况、已采取的措施、效果评价等。\n" +
            "\n" +
            "Ⅲ.医疗机构\n" +
            "（1）开展病人接诊、收治和转运工作，实行重症和普通病人分开管理，对疑似病人及时排除或确诊。\n" +
            "（2）对群体性不明原因疾病和新发传染病做好病例分析与总结，积累诊断治疗经验。重大中毒事件，按照现场救援、病人转运、后续治疗相结合的原则进行处置。\n" +
            "（3）搞好医院内现场控制、消毒隔离、个人防护、医疗垃圾和污水处理等，防止院内交叉感染和污染。\n" +
            "（4）负责传染病和中毒病人的报告。对突发公共卫生事件造成身体伤害的病人，任何医疗机构不得拒绝接诊。\n" +
            "（5）协助疾病预防控制机构人员开展标本采集、流行病学调查等工作。\n" +
            "\n" +
            "Ⅳ.疾病预防控制机构\n" +
            "（1）报告信息。各级疾病预防控制机构要搞好突发公共卫生事件的信息收集、分析与报告。\n" +
            "（2）进行流行病学调查。疾控机构人员到达现场后，尽快制定流行病学调查计划和方案，按照计划和方案对突发事件累及人群的发病情况、分布特点进行调查分析，提出并实施有针对性的预防控制措施；对传染病病人、疑似病人、病原携带者及其密切接触者进行追踪调查，查明传播链，并向相关疾病预防控制机构通报情况。\n" +
            "（3）开展实验室检测。市和区县疾病预防控制机构根据国家疾病预防控制中心的要求，开展危险因素检测，按照有关技术规范采集和分送标本、承担现场和实验室检测任务，查找致病原因。\n" +
            "（4）开展科研与国际交流。开展与突发事件相关的诊断试剂、疫苗、消毒方法、医疗卫生防护用品等方面的研究和国际交流。\n" +
            "（5）制定技术方案。市疾病预防控制中心协助市卫生局根据国家有关技术标准和规范，制定本市的技术方案或实施方案。\n" +
            "（6）开展技术培训。市、区县疾病预防控制中心分级负责本市各级医疗机构突发公共卫生事件应急处置专业技术人员的应急培训。\n" +
            "\n" +
            "Ⅴ.卫生监督机构\n" +
            "（1）在卫生部门的领导下，开展对医疗机构、疾病预防控制机构突发公共卫生事件应急处置各项措施落实情况的督导、检查。\n" +
            "（2）围绕突发公共卫生事件应急处置工作，开展卫生监督，对发现存在问题的情况提出行政处罚的意见。\n" +
            "（3）依据《突发公共卫生事件应急条例》和有关法规、规章，调查处理突发公共卫生事件应急处置中的违法行为。\n" +
            "\n" +
            "Ⅵ.出入境检验检疫机构\n" +
            "（1）突发公共卫生事件发生后，调动出入境检验检疫机构技术力量，对出入境、进出疫区和运行中的交通工具及其乘运人员、物资、宿主动物等进行检疫查验；对病人、疑似病人及其密切接触者实施临时隔离、留验，并移交指定机构。\n" +
            "（2）及时上报和通报口岸突发公共卫生事件信息和事态发展。\n" +
            "\n" +
            "Ⅶ.非事发地区\n" +
            "未发生突发公共卫生事件的区县要根据其他地区发生事件的性质、特点、发生区域和发展趋势，分析本地区受波及的可能性和危害程度，重点做好以下工作：\n" +
            "（1）密切保持与事件发生地区的联系，及时获取相关信息。\n" +
            "（2）组织做好本行政区域应急处置所需的人员与物资准备。\n" +
            "（3）加强相关疾病与健康监测和报告工作，必要时，建立专门报告制度。\n" +
            "（4）开展重点人群、重点场所和重点环节的监测和预防控制。\n" +
            "（5）开展防治知识宣传和健康教育，提高公众自我保护意识和能力。\n" +
            "（6）根据市政府及其有关部门决定，开展交通卫生检疫等。\n",
        },
        {
          value: "4-4",
          label: "4.4 应急响应终止",
          text: "突发公共卫生事件应急响应的终止需符合以下条件：突发公共卫生事件隐患或相关危险因素消除，或末例传染病病例发生后经过最长潜伏期无新的病例出现。\n" +
            "特别重大突发公共卫生事件由卫生部组织有关专家进行分析论证，提出终止应急响应的建议，报国务院或国家相关应急指挥机构批准后实施。\n" +
            "重大突发公共卫生事件由市卫生局组织专家进行分析论证，提出终止应急响应的建议，报市政府或市应急处置指挥部批准后实施，并向卫生部报告。\n" +
            "较大突发公共卫生事件由市卫生局组织专家进行分析论证，提出终止应急响应的建议，报市政府批准后实施。\n" +
            "一般突发公共卫生事件由区县卫生部门组织专家进行分析论证，提出终止应急响应的建议，报区县政府或区县突发公共卫生事件应急指挥机构批准后实施，并向市卫生局报告。\n",
        },
        {
          value: "5",
          label: "5 后期处置",
          text: "",
        },
        {
          value: "5-1",
          label: "5.1 后期评估",
          text: "突发公共卫生事件结束后，各级卫生部门要在本级政府的领导下，组织有关人员对突发公共卫生事件的处置情况进行评估。评估内容主要包括事件概况、调查处置情况、病人救治情况、所采取措施的效果评价、应急处置过程中存在的问题、取得的经验及改进建议。评估报告上报本级政府和上一级卫生部门。\n",
        },
        {
          value: "5-2",
          label: "5.2 抚恤和补助",
          text: "有关部门对因参与应急处置工作致病、致残、死亡的人员，按照国家有关规定，给予相应的补助和抚恤；对参加应急处置一线工作的专业技术人员，要根据工作需要制定合理的补助标准，给予补助。\n",
        },
        {
          value: "5-3",
          label: "5.3 征用物资、劳务补偿",
          text: "突发公共卫生事件应急工作结束后，各级政府要组织有关部门对应急处置期间紧急调集、征用有关单位、企业、个人的物资和劳务进行评估，给予合理补偿。\n",
        },
        {
          value: "6",
          label: "6 应急保障",
          text: "突发公共卫生事件应急处置要坚持预防为主、平战结合。本市各级政府和卫生部门要加强应对突发公共卫生事件的组织建设，组织开展突发公共卫生事件的监测和预警工作，加强突发公共卫生事件应急处置队伍建设和技术研究，建立健全统一的突发公共卫生事件预防控制体系，保证突发公共卫生事件应急处置的顺利实施。\n"
        },
        {
          value: "6-1",
          label: "6.1 技术保障",
          text: "Ⅰ.信息系统\n" +
            "建立公共卫生事件应急信息系统，承担突发公共卫生事件及相关信息收集、处理、分析、发布和传递等工作，为日常监测、预警、报告和应急处置提供支撑；实现卫生部门、医疗救治机构与疾病预防控制机构、卫生监督机构之间的信息共享。\n" +
            "\n" +
            "Ⅱ.疾病预防控制体系\n" +
            "建立统一的疾病预防控制体系。强化疾病预防控制机构和基层预防保健组织建设，强化医疗卫生机构疾病预防控制的责任；建立功能完善、反应迅速、运转协调的突发公共卫生事件应急机制；健全覆盖全市、灵敏高效、快速畅通的疫情信息网络；完善疾病预防控制机构基础设施和实验室设备条件；加强疾病控制专业队伍建设，提高流行病学调查、现场处置和实验室检测检验能力。\n" +
            "\n" +
            "Ⅲ.应急医疗救治体系\n" +
            "建立由市和区县医疗救护机构、各类重点医疗机构及其他有关单位组成的应急医疗救治网络。逐步在本市建成覆盖城乡、功能完善、反应灵敏、运转协调、持续发展的医疗救治体系。\n" +
            "\n" +
            "Ⅳ.卫生执法监督体系\n" +
            "各级卫生部门要明确职能，落实责任，规范执法监督行为。加强卫生执法监督队伍建设，对卫生监督人员实行资格准入制度和在岗培训制度，全面提高卫生执法监督的能力和水平。\n" +
            "\n" +
            "Ⅴ.应急卫生救治队伍\n" +
            "各级政府卫生部门按照“平战结合、因地制宜，分类管理、分级负责，统一组织、协调运转”的原则建立突发公共卫生事件应急救治队伍。\n" +
            "\n" +
            "Ⅵ.科研和国际交流\n" +
            "鼓励和支持相关部门和单位开展突发公共卫生事件有关技术的科学研究，以及相应的国内外交流与合作。\n" +
            "有计划地开展应对突发公共卫生事件相关的防治科学研究，包括现场流行病学调查方法、实验室病因检测技术、药物治疗、疫苗和应急反应装备、中医药及中西医结合防治等，尤其是开展新发、罕见传染病快速诊断方法、诊断试剂以及相关的疫苗研究，实现技术储备。同时，开展应对突发公共卫生事件应急处置技术的国际交流与合作，学习和适当引进国外先进技术、装备和方法，提高本市应对突发公共卫生事件的整体水平。\n",
        },
        {
          value: "6-2",
          label: "6.2 物资保障",
          text: "根据“分级管理”原则和各自职责，负责组织协调相关应急物资的储备、调度和后续供应。市发展改革委、市经委等按照市应急处置指挥部的指令，负责组织协调应急处置中应急物资的调用和供应，各相关部门和单位负责具体实施。\n",
        },
        {
          value: "6-3",
          label: "6.3 经费保障",
          text: "突发公共卫生事件常态管理所需的经费,由市卫生局报请市财政列入年度预算。应急处置所需的经费，由市财政按照有关预案和规定予以安排。\n",
        },
        {
          value: "6-4",
          label: "6.4 通信保障",
          text: "各级应急医疗卫生救治队伍要根据实际工作需要配备通信设备。\n",
        },
        {
          value: "6-5",
          label: "6.5 交通保障",
          text: "市交通局负责提供突发公共卫生事件应急处置的交通保障，有关区县政府协助配合。\n",
        },
        {
          value: "6-6",
          label: "6.6 治安保障",
          text: "突发公共卫生事件发生后，实施现场治安警戒；事发地区县政府协助搞好治安保障。\n",
        },
        {
          value: "7",
          label: "7 监督管理",
          text: "",
        },
        {
          value: "7-1",
          label: "7.1 公众宣传教育",
          text: "各级政府要组织有关部门利用广播、影视、报刊、互联网、手册等多种形式对社会公众广泛开展突发公共卫生事件应急知识普及教育，宣传卫生科普知识，指导群众以科学的行为和方式对待突发公共卫生事件。要充分发挥有关社会团体在普及卫生应急知识和卫生科普知识方面的作用。\n",
        },
        {
          value: "7-2",
          label: "7.2 演练",
          text: "各级卫生部门和有关单位要按照“统一规划、分类实施、分级负责、突出重点、适应需求”的原则，采取定期和不定期相结合的形式，组织开展突发公共卫生事件的应急演练。\n" +
            "\n" +
            "市卫生局要组织全市性的突发公共卫生事件应急演练，检验和加强应急处置能力，并对演练结果进行总结和评估，进一步完善应急预案。\n",
        }
      ],
      choice_advice: 1,//判断是选择用传统的仿真模拟建议还是说用预案编制助手（LLM）
      LLM_URL: 'http://100.64.226.144:8012/',

      chartInfectionPlan: null,
      currentTask: null,
      infectionPopulationPlanData:              // 传染病感染总人数数据(联防联控)
        {
          xName: '模拟时刻(小时)',
          yName: '感染总人数(人)',
          xData: {
          },
          yData: [],
          useZoom: true,
        },
      thresholdInfected: 10,               // 高风险感染人数阈值
      updateRiskDisabled: false,
      infectionDangerousPointList: [            // 传染病防灾重点区域
      ],
      adviceInfection: {
        peopleCount: 0,
        carCount: 0,
        riskList: [],
      },
      currentInfectionDay: 1,             // 当前传染病模拟时间(天)
      currentInfectionHour: 1,            // 当前传染病模拟时间(小时)
      maxInfectionDay: 1,
      grid_data: null,
    }
  },
  created() {

  },
  mounted() {
    let elems = document.getElementsByClassName("update")
    for (let i = 0; i < elems.length; i++) {
      elems[i].setAttribute("contenteditable", "true")
    }
    this.currentTask = this.task
    this.maxInfectionDay = this.currentTask.para_json.simulation_days
    this.updateRiskDisabled = true;
    this.processInfectionDangerousList();
    this.updateRiskDisabled = false;
  },
  methods: {
    exportToWord() {
      const preActiveNames = this.activeNames;
      this.activeNames = this.ChosedItem;
      this.$nextTick(()=>{
        // 获取要导出的 <div> 元素
        const divElement = document.getElementById('exportContent')

        // 获取 <div> 元素的 HTML 内容
        const htmlContent = divElement.innerHTML
        // 转换 HTML 为 Word 文档
        const convertedContent = htmlDocx.asBlob(htmlContent)

        // 创建一个下载链接并触发下载
        const downloadLink = document.createElement('a')
        downloadLink.href = URL.createObjectURL(convertedContent)
        downloadLink.download = 'infection_plan_' + this.city + '.docx'
        downloadLink.click()
        this.activeNames = preActiveNames
      });

    },
    getAdviceInfection(type,population){
      if(type === "road" || type === "highway")
        return `该区域为公路区域，目前感染人数为${population}。传播风险较高，建议采取交通限制措施，如关闭某些道路、桥梁或入口，以限制人员和车辆的流动，可以减缓疾病的传播速度。另外，增加城市道路和公共场所的清洁频率，定期消毒公共交通工具、站点、手扶梯等，消灭病毒，保障市民的安全和健康。`
      if(type === "man_made")
        return `该区域为人流较为密集的区域，目前感染人数为${population}，接触感染者的风险较高，建议控制人群流量和人群接触距离，取消大规模人群聚集活动，避免感染大规模暴发。同时，需要注意控制场所人群流量的方法，避免引发人群恐慌。最后，建议定时对公共场所进行消毒，切断病毒传播途径。`
      if(type === "amenity" || type === "place")
        return `该区域为公共设施区域，为人群提供生活服务保障服务，目前感染人数为${population}。该区域建议鼓励人们在公共设施中保持社交距离，通常建议至少保持2米的距离。鼓励或要求人们在公共设施中佩戴口罩，特别是在无法保持足够社交距离的情况下。在可能的情况下，支持远程工作和在线服务，以减少人们在公共设施中的互动。定期清洁和消毒高触摸表面，如门把手、电梯按钮、扶手、公共厕所的水龙头和抽水马桶按钮等。`
      if(type === "tourism")
        return `该区域为旅游热点，目前感染人数为${population}。因为吸引了大量的游客，游客之间的密切接触，容易促进传染病的传播，区域传播风险较高。建议限制景点、餐馆、酒店等公共场所的入场人数，以确保游客能够保持足够的社交距离。在需要排队等候的地方标记出安全距离，并设立社交距离监控点。同时，建议与当地卫生部门合作，密切监测传染病的流行情况，根据需要采取适当的措施，例如加强防控措施或限制进入。`
      if(type === "building")
        return `该区域内包含建筑物，目前感染人数为${population}。建筑物内人群高度密集，长时间聚集导致感染几率增加。建议在建筑物内的公共区域标记出安全的社交距离，如电梯、候诊区、食堂等。促使员工和访客保持社交距离，并限制人数以避免拥挤。在建筑物内设置足够的洗手站点，并提供洗手液和纸巾。鼓励远程工作和在线会议，以减少建筑物内的人员流动。`
      return null;
    },
    // 处理传染病防灾重点区域
    processInfectionDangerousList() {
      console.log("processInfectionDangerousList");
      this.infectionDangerousPointList = [];
      this.adviceInfection.peopleCount = 0;
      this.adviceInfection.carCount = 0;
      this.adviceInfection.riskList = [];
      let features = this.riskSource.getFeatures();

      features.forEach((feature) => {
        let info = feature.info;
        if (info) {
          console.log(info);
          let gid = info.id;
          let coords = info.center;
          let population = Math.round(info.value);
          let url = serverInfo.baseURL_reverse + `/reverse.php?format=jsonv2&lat=${coords[1]}&lon=${coords[0]}`;
          axios.get(url)
            .then(res => {
              if (res.status === 200) {
                let reverseInfo = res.data;
                this.infectionDangerousPointList.push({
                  gid: gid,
                  lon: coords[0].toFixed(4),
                  lat: coords[1].toFixed(4),
                  population: population,
                  display_name: reverseInfo.display_name,
                  reverseInfo: reverseInfo,
                });
                let text = this.getAdviceInfection(reverseInfo.category, population);
                if (text)
                  this.adviceInfection.riskList.push({
                    name: reverseInfo.display_name.split(',')[0],
                    text: text
                  })
                this.adviceInfection.peopleCount += population;
                this.adviceInfection.carCount += Math.ceil(population / 4);
              }
            })

        }
      });

    },
  },
};
</script>
<style lang="scss" scoped>
// 标题
.title {
  text-align: center;
  font-size: 48px;
  font-family: Source Han Sans CN-Bold, Source Han Sans CN;
  font-weight: bold;
  color: #1f4e79;
}

// 页面主体布局
.layout-main {
  display: flex;
  flex-direction: row;
  justify-content: center;
  width: 100%;
  margin: 10px auto;
  padding: 20px 10px;

  border-radius: 10px;
  box-shadow: 1px 1px 4px 2px rgba(39, 56, 98, 0.2);

  .layout-row {
    width: 100%;
  }
}

.layout-edit {
  overflow: scroll;
  width: 100%;
  height: 100vh;

  .layout-row {
    width: 100%;
  }
}

.helpTitle {
  text-align: center;
  font-weight: bold;
  font-size: large;
  margin: 5px 0;
}

.el-icon-question:hover {
  cursor: pointer;
}

.line {
  display: flex;
  flex-direction: row;
  align-items: center;
  width: 100%;
}

pre {
  font-size: 14px;
  font-family: "宋体","仿宋",sans-serif;
  //white-space: pre-wrap;
}

.update {
  color: red;
}

.monitor-info {
  display: inline-block;
  width: 18px;
  height: 18px;
  line-height: 18px;
  font-size: 14px;
  color: #fff;
  text-align: center;
  background-color: #BCDBEA;
  border-radius: 50%;
  margin-left: 3px;
}

.simu-result {
  padding: 0 8px 10px 8px;
  margin: 0;

  // 图表容器
  .chart-container {
    width: 100%;
    height: 35vh;
    border-radius: 4px;
  }

  // 图表
  .chart {
    height: 100%;
    transition: 0.3s;
  }
}
</style>
